OpenFOAM/OpenFOAM-2.2.x/tutorials/combustion/fireFoam/les/oppositeBurningPanels/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    top
    {
        type            calculated;
    }

    ground
    {
        type            calculated;
    }

    sides
    {
        type            calculated;
    }

    burner
    {
        type            calculated;
    }

    "(region0_to.*)"
    {
        type            calculated;
    }
}


// ************************************************************************* //
