OpenFOAM/OpenFOAM-2.2.x/tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,Yi_h)  Gauss multivariateSelection
    {
        O2              linearUpwind grad(O2);
        N2              linearUpwind grad(N2);
        C3H8            linearUpwind grad(C3H8);
        H2O             linearUpwind grad(H2O);
        CO2             linearUpwind grad(CO2);
        h               linearUpwind grad(h);
    };
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,K)          Gauss limitedLinear 1;
    div(Ji,Ii_h)        Gauss upwind;
}

laplacianSchemes
{
    //default         none;
    default         Gauss linear corrected;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(thermo:alpha,h) Gauss linear corrected;
    laplacian((((rho*(1|A(U)))*rho)*gh)) Gauss linear corrected;
    laplacian(interpolate((rho*(1|A(U)))),p) Gauss linear corrected;
    laplacian(gammaRad,G) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    phiMesh;
}


// ************************************************************************* //
